## Feature Engineering 02

In [1]:
import pandas as pd
import numpy as np

In [4]:
titanic = pd.read_csv('dataset/train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Data Binning

In [5]:
titanic.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [7]:
titanic.Age.min()

0.42

In [8]:
titanic.Age.max()

80.0

In [25]:
# create a new age column 
age = titanic['Age']
df = pd.DataFrame(age)

# crete data bining labels
cut_labels = ['child', 'tennage', 'young adult', 'mid_age adult', 'old']
# define cut range
cut_bins = [0, 12, 18, 35, 55, 80]

# make binning by using cut (convert numerical data to categorical data with a range)
df['Age binning'] = pd.cut(df['Age'], bins=cut_bins, labels=cut_labels)
df

      Age    Age binning
0    22.0    young adult
1    38.0  mid_age adult
2    26.0    young adult
3    35.0    young adult
4    35.0    young adult
..    ...            ...
886  27.0    young adult
887  19.0    young adult
888   NaN            NaN
889  26.0    young adult
890  32.0    young adult

[891 rows x 2 columns]

In [26]:
titanic.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [40]:
cls = titanic['Pclass']

# create dataframe
df = pd.DataFrame(cls)

# one hot algorightm for categorial data to numerical data
one_hot = pd.get_dummies(df['Pclass'], prefix='Plcass').astype(int)

df = df.join(one_hot)
df

     Pclass  Plcass_1  Plcass_2  Plcass_3
0         3         0         0         1
1         1         1         0         0
2         3         0         0         1
3         1         1         0         0
4         3         0         0         1
..      ...       ...       ...       ...
886       2         0         1         0
887       1         1         0         0
888       3         0         0         1
889       1         1         0         0
890       3         0         0         1

[891 rows x 4 columns]